import menuData from './fnAppData.json'
import Ux from 'ux';

const MENUS = {
    "HOTEL.MANAGER": [ // 总经理
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        "9eb7056d-ece3-4e3b-80e4-874a01957c7e", // 预订管理 - 房间资源
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "LABOR.MANAGER": [ // 大堂经理
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        'f405e552-97bb-4714-8f49-4fbbe6ac1717', // 预订管理 - 历史订单
        "9eb7056d-ece3-4e3b-80e4-874a01957c7e", // 预订管理 - 房间资源
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "98de5c49-4939-4d45-b6da-54a05fefa9cd", // 前台接待 - 本日排房
        "24192731-837c-4227-97a6-771905d412e1", // 前台接待 - 宾客列表
        "82fba012-feab-4ea2-aebf-edfddf58c52c", // 前台接待 - 宾客档案
        "b34c5dd9-97ca-4686-8063-a743d70ebdcb", // 账务稽核
        "1a09047b-46ca-42b2-a329-00d02202260c", // 账务稽核 - 账务列表
        "4424332f-c431-411d-adc4-08441670bb90", // 账务稽核 - 应收处理
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "LABOR.EMPLOYEE": [ // 接待职员
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        "9eb7056d-ece3-4e3b-80e4-874a01957c7e", // 预订管理 - 房间资源
        "c7c661a3-24d9-4f9f-b88f-4dae421c23a9", // 预订管理 - 新增预定
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "d41638d8-4f62-4d1e-afa2-23a44fc68cbb", // 前台接待 - 散客入住
        "40b39aa9-1223-405d-8911-83036cf20aad", // 前台接待 - 团队入住
        "24192731-837c-4227-97a6-771905d412e1", // 前台接待 - 宾客列表
        "82fba012-feab-4ea2-aebf-edfddf58c52c", // 前台接待 - 宾客档案
        "4e85a291-9012-4c24-b667-e182a408c92e", // 前台接待 - 夜审管理
        'd6ff4e26-732a-40f8-b925-c764fad7f213', // 销售管理
        'c038480d-5d03-46f0-814c-98ff764ed69d', // 销售管理 - 会员发卡
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "LABOR.FAN": [ // 收银职员
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "24192731-837c-4227-97a6-771905d412e1", // 前台接待 - 宾客列表
        "82fba012-feab-4ea2-aebf-edfddf58c52c", // 前台接待 - 宾客档案
        "4e85a291-9012-4c24-b667-e182a408c92e", // 前台接待 - 夜审管理
        "b34c5dd9-97ca-4686-8063-a743d70ebdcb", // 账务稽核
        "1a09047b-46ca-42b2-a329-00d02202260c", // 账务稽核 - 账务列表
        'd617efd3-17d7-4b28-9514-3ad17f07c1a4', // 账务稽核 - 哑房入账
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "SALES.MANAGER": [ // 销售经理
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        'f405e552-97bb-4714-8f49-4fbbe6ac1717', // 预订管理 - 历史订单
        "9eb7056d-ece3-4e3b-80e4-874a01957c7e", // 预订管理 - 房间资源
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "24192731-837c-4227-97a6-771905d412e1", // 前台接待 - 宾客列表
        "4e85a291-9012-4c24-b667-e182a408c92e", // 前台接待 - 夜审管理
        'd6ff4e26-732a-40f8-b925-c764fad7f213', // 销售管理
        'ec0b0d9e-5cf4-4454-a2f1-c574a138c688', // 销售管理 - 客人来源
        '43e97ff3-445e-4ed2-bf1b-97432d05db5f', // 销售管理 - 市场分类
        '90fb3765-3008-4b7d-9e80-90b10c57820e', // 销售管理 - 房价设置
        'd4579ae9-e230-4eb4-a67b-9f1422c7258c', // 销售管理 - 客户管理
        'b37d64a0-1ae7-4102-92de-dab20abaced7', // 销售管理 - 会员设置
        '43870be4-479c-449c-a90e-bd500446945f', // 销售管理 - 预订方式
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "SALES.EMPLOYEE": [ // 销售职员
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        "9eb7056d-ece3-4e3b-80e4-874a01957c7e", // 预订管理 - 房间资源
        "c7c661a3-24d9-4f9f-b88f-4dae421c23a9", // 预订管理 - 新增预定
        'f405e552-97bb-4714-8f49-4fbbe6ac1717', // 预订管理 - 历史订单
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "24192731-837c-4227-97a6-771905d412e1", // 前台接待 - 宾客列表
        "4e85a291-9012-4c24-b667-e182a408c92e", // 前台接待 - 夜审管理
        'd6ff4e26-732a-40f8-b925-c764fad7f213', // 销售管理
        'd4579ae9-e230-4eb4-a67b-9f1422c7258c', // 销售管理 - 客户管理
        'c038480d-5d03-46f0-814c-98ff764ed69d', // 销售管理 - 会员发卡
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "FAN.MANAGER": [ // 财务经理
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "FAN.EMPLOYEE": [ // 财务员
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "0ee47600-5a13-44f5-a683-0adda35cde87", // 前台接待
        "d7056f1a-33c6-429c-b5ce-e65785c87501", // 前台接待 - 房态图
        "b34c5dd9-97ca-4686-8063-a743d70ebdcb", // 账务稽核
        "1a09047b-46ca-42b2-a329-00d02202260c", // 账务稽核 - 账务列表
        "4424332f-c431-411d-adc4-08441670bb90", // 账务稽核 - 应收处理
        'd617efd3-17d7-4b28-9514-3ad17f07c1a4', // 账务稽核 - 哑房入账
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "ROOM.MANAGER": [ // 客房经理
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "ee71d6a6-ab61-4a28-b890-e1f021d23a30", // 房务中心
        '5556747b-f5c8-4b07-a8d3-3150b01770a8', // 房务中心 - 房态管理
        "d8f5c6d9-175a-47f9-8dfa-449896ce0810", // 房务中心 - 房态图
        'f1c581fa-4486-4c64-aabb-369bd0f8f721', // 房务中心 - 商品设置
        'c1449d9d-7662-4005-bc8b-9fecd02889a4', // 房务中心 - 赔偿设置
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "ROOM.EMPLOYEE": [ // 客户人员
        "e045bafb-36b4-4549-816d-abdf48190ca8", // 我的待办
        "ee71d6a6-ab61-4a28-b890-e1f021d23a30", // 房务中心
        '5556747b-f5c8-4b07-a8d3-3150b01770a8', // 房务中心 - 房态管理
        "d8f5c6d9-175a-47f9-8dfa-449896ce0810", // 房务中心 - 房态图
        'f1c581fa-4486-4c64-aabb-369bd0f8f721', // 房务中心 - 商品设置
        'c1449d9d-7662-4005-bc8b-9fecd02889a4', // 房务中心 - 赔偿设置
        "77e5f9bd-7b6f-40b6-9bcd-649ea135de68", // 预订管理
        '654ba85e-1c17-47af-a975-31252967fa42', // 预订管理 - 订单处理
        "9cbfbd3c-875d-4f60-a0d6-c2977be79334", // 报表中心
    ],
    "SYSTEM.ADMIN": [ // 系统管理员
        'e42875dd-c5e3-432c-b4d6-9afc9e95af26', // 系统设置
        'eac03e15-4980-41cc-b77d-0ba942ea0991', // 系统设置 - 用户管理
        '4f2d8876-47c8-44aa-9ebf-e7271009d6a5', // 系统设置 - 用户管理 - 用户设置
        'e574cb3a-e77f-45b2-9ab8-d60a5c162a38', // 系统设置 - 用户管理 - 角色管理
        'bbee042a-7ddb-4f1c-a91a-1b35eba9567d', // 系统设置 - 用户管理 - 菜单设置
        '809242d5-826e-4669-8424-115ae447115e', // 系统设置 - 用户管理 - 密码管理
        'f37ffb17-5b54-4278-a463-4dba38da49ef', // 系统设置 - 基础设置
        'c83b1368-2aa4-4041-987b-0dbbb9c3bdd3', // 系统设置 - 基础设置 - 初始参数
        '1ef7847a-5d0b-42fb-a2c0-7a59dff7856d', // 系统设置 - 基础设置 - 打印参数
        'e5f52595-cefd-404a-adc9-045ab38f3e22', // 系统设置 - 基础设置 - 酒店设置
        '216603e2-9b07-407f-8bf0-25a08a1fe9f6', // 系统设置 - 基础设置 - 班别设置
        'fa259298-a4a4-4da3-b51d-23ca9fc553a8', // 系统设置 - 组织架构
        '18b64f54-cf90-4780-9e12-5e2796a4e705', // 系统设置 - 上级日志
        '221a2fbe-626a-4caf-9eac-12c35df2c621', // 系统设置 - 客房设置
        '0161f6e8-c05f-4520-a1f5-61ac85d71108', // 系统设置 - 客房设置 - 房型设置
        '34d8915a-0d8c-45fc-8d7f-fa0669319c39', // 系统设置 - 客房设置 - 房间特征
        '0fddebc1-09a2-432f-9df3-cf685e6f4b04', // 系统设置 - 客房设置 - 房间设置
        '90fb3765-3008-4b7d-9e80-90b10c57820e', // 系统设置 - 客房设置 - 房价设置
        '4a516e0e-392e-45f7-bfe6-d94bf02d80ad', // 系统设置 - 账单项目
    ],
};
export default {
    mock: false,
    data: menuData.data,
    processor: (data) => {
        const user = Ux.isLogged();
        if (user) {
            const roleCode = user.roleCode;
            const menus = MENUS[roleCode];
            if (menus) {
                data = data.filter(item => menus.includes(item.key))
            } else if ("SUPER.ADMIN" !== roleCode) {
                data = [];
            }
        }
        return data;
    }
}